using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Курсовая_работа_ИЦГН_
{
    class Voprosi
    {
        public string[][] vopros = {
            new string[]{ "1.   Что такое центральный процессор(ЦП) ?","Электронный блок либо интегральная схема, исполняющая машинные инструкции.","Устройство, преобразующее графический образ, хранящийся как содержимое памяти компьютера, в форму, пригодную для дальнейшего вывода на экран монитора.","Устройство, предназначенное для формирования напряжений питания компьютерных систем.","Запоминающее устройство произвольного доступа, основанное на принципе магнитной записи." },
            new string[]{ "2.	Как вы чистите свой компьютер?", "С помощью влажных тряпок или салфеток.", "Зачем его чистить?", "Протираю внешние элементы сухой салфеткой.", "Чищу внутренние и внешние части компьютера с помощью специальных чистящих средств." },
            new string[]{ "3.	Из чего состоит персональный компьютер (ПК)?", "Из материнской платы, сетевой карты, ЦП, Видеокарты и т.д.", "Из магии и любви.", "Устройств ввода и вывода, системного блока.", "из микросхем и магии." },
            new string[]{ "4.	Что такое BIOS?", "Программа управления внешним устройством компьютера.", "Набор микропрограмм, реализующих API для работы с аппаратурой компьютера и подключёнными к нему устройствами.", "Основной накопителель данных в большинстве компьютеров.", "Электронные и механические части вычислительного устройства."},
            new string[]{ "5.	Часть пользовательского интерфейса Microsoft Windows, используемая для настройки системы (панель управления)"},
            new string[]{ "6.	Как часто вы платите за интернет?", "1 раз в месяц.", "Я не плачу за него.", "1 раз в 6-12 месяцев.", "1 раз в несколько лет." },
            new string[]{ "7.	Сколькими устройствами вы пользуетесь?"},
            new string[]{ "8.	Есть ли у вас персональный компьютер?", "Да.", "Нет."},
            new string[]{ "9.	Как часто вы пользуетесь компьютером?", "Никогда", "почти никогда", "редко", "довольно-таки часто" },
            new string[]{ "10.	Вам пришло сообщение о выигрыше крупной суммы от неизвестного пользователя! Ваши действия:", "Сообщить всем своим родственникам", "Отослать все необходимые данные", "IT'S A TRAP!", "Не стану ничего высылать, проигнорировав сообщение" },
            new string[]{ "11.	Есть ли у вас антивирус?", "Да!", "Нет."},
            new string[]{ "12.	Часто ли вы скачиваете файлы с незнакомых сайтов?", "Каждый раз, когда мне необходимы какие-либо файлы", "Я пользуюсь только официальными источниками", "Довольно редко скачиваю", "Стараюсь не скачивать файлы с незнакомых сайтов" },
            new string[]{ "13.	Сопоставьте различные виды киберугроз с их определениями:", "Засорение электронной почты множеством писем", "Вид интернет-мошенничества, целью которого является получение доступа к конфиденциальным данным пользователей", "Взлом ПК из любой точки мира", "Специальным образом организованные массированные сетевые запросы" },
            new string[]{ "14.	Что делать если у вас взломали аккаунт?", "Обратиться в техподдержку, одновременно с этим меняя пароли на связанных с этим аккаунтами.", "Выполнить все условия мошенников.", "Игнорировать взлом.", "Удалить свой аккаунт." },
            };
    }
}
